{"pageProps":{"othersData":{"id":"my-purposes-for-2022","contentHtml":"<p>   Basically, I would like to share with my thoughts after 2 years of silence on my private blog.\nMostly, I want share with you about my goals for 2023 year.\nCorrect prioritization, should guide me on the right path to reach my main purposes this year.</p>\n<p>   As a first target, I want update my site(personal blog). Rewrite fundamentally from static site to\ndynamic site, now if you will try to update any article page, you will see that page will show\n404 error. </p>\n<p>   I want to write more technical articles more often, and more specifically, for this year I have planned at least two hundred\narticles on technical topics. I want to resume topics that I left later, for various reasons\ncould not write before.</p>\n<p>   Explore the topic of machine learning in depth. In the future, I want to apply my knowledge to more\npractical projects and publish them for public viewing.</p>\n<p>   Since the beginning of the new year, I completely abandoned social networks in order to devote more time to my business.\nI gave up social networks like Facebook, Twitter and was the last to give up Instagram.\nIf you would look at my personal statistics of spending time on social networks past few years, you would see that it ate a lot of my personal time. I found that it really kills a lot of time that I could spend on really interesting tasks. That's why I decided to abandon social networks. I extracted most of the information from social networks in the last years, I think from now on, I will start my work on refocusing my attention from social networks.</p>\n<p>   As the next goal for this year, I want to start serious preparations for MANGA. To achieve such target,\nI need to work hard towards developing my ability to solve algorithmic problems.\nLearn more about design systems. If we talk about algorithmic problems, this year I plan to solve\nat least 300 easy-level problems, at least 200 medium-level problems, and at least 200\nhard tasks on leetcode. This should serve as a good basis for me to send my CV and\nspend interviews in the right way. I will write articles on problem analysis, on the meaning of tasks, where we can apply this solutions,\nabout the practical purpose of the task, and I will show examples of how to apply these solutions. These articles should\nattach in my mind the solutions to these problems.</p>\n<p>   Every quarter I will show statistics and the status of my tasks. In parallel, I will tell the experience of my interviews,\nabout the stages of interviews, about the questions that I met, and how I answered them. Thus will help you to\nunderstand how to act in certain situations and answer questions from an interviewer.</p>\n<p>   I'm planning to read at least five books about technical problems and describe my thoughts about solving specific problems.</p>\n<p>   At this stage of my life, I was faced with the problem of building houses in Kazakhstan. I would like to describe\nlife situations in the construction of my house in the city of Atyrau, and how I implemented some solutions from different problems and solved problems with hiring workers and how I organized processes, the initial stage of building a house, the purchase of materials and their prices etc.\nThis should help me track the trend of the development in the market and the situation around it in 2023 compared to 2022.</p>\n<p>   Mostly, that's all. In the new year, wish you new discoveries!</p>\n","title":"Short description to my purposes for 2023","date":"2023-01-20"}},"__N_SSG":true}