{"pageProps":{"othersData":{"id":"sapiens-brief-history-of-humankind","contentHtml":"<br/>\n<hr>\n  <blockquote>\n   <p style=\"font-size: 16px; font-style: italic;\">\n      One of the 10 books which you can take to uninhabited island according to Bill Gates.\n   </p>\n  </blockquote>\n<hr>\n<br/>\n<img src=\"/images/sapiens.jpg\" style=\"width: 100%%; margin: 0 auto;\">\n<p>    Right now, in the current time we are living in a modern society, where a lot of concepts interact between each other and these concepts were not created from scratch. These ideas affect your life not less than coffee which you drink every morning before your job or maybe even more. So, where do the legs of the modern monetary system come from? How are humans really different from animals? Why do people strive for globalization? Why is capitalism a basic religion in a contemporary society? And many other questions asked in this book, and author Yuval Noah Harari try to answer these questions. Definitely I think you can find something interesting for you in this book.</p>\n<p>    The first reason why you should read this book, if you are interested in history but you don’t want to dive deep into it, then undoubtedly this book is for you. Addictive stories about the cognitive revolution, superficial explanations about how our ancestors went through the stages of evolution, how they learned walking upright or the cost of acquiring a more advanced brain. Of course, I know there are a lot of people who do not believe in the theory of evolution but even if that’s true, it would be useful in the perspective of exploring a different point of view.</p>\n<p>    The one more justification for “why you need to read this book” is the next part about the agricultural revolution. You will like or maybe you will be very impressed with the idea of the author, about how primitive peoples switched to a settled way of life. Oh, it is really something, and in this part you will know one of the causes why we make one step forward to a more comfortable life and at the same time one step backward in the pursuit of happiness. </p>\n<p>    A further reason is about “The unification of humankind”. What unites all people on the planet? It is money. Country boundaries are blurring, some languages are leaving and in its place comes general English or any other dominant language, peoples clothes are the same everywhere, living in Kazakhstan we can eat bananas which are exported from India or somewhere else... and it slowly changes everything. If you were living in the 15th century, a village nearby could have a completely different mentality or even its own language, and they could kill you just because you are from another village. Isn't it wonderful?!\nWe are all living in the era of globalization, cultural identification of every nation slowly beginning to fade away, the rulers of all countries throughout history have always tried to introduce one type of thinking among the population to control them. What do you think, what it is? Answer you will find in the book.</p>\n<p>    Last but not less important is “The Scientific Revolution” part where Harari starts to predict the possible future for humankind demonstrating the work of Robert Oppenheimer(notorious scientific work) where we can see a very big and destructive mushroom cloud. This represents how people make progress from sticks and clubs to atomic bombs. The last 20th century, became a time of unprecedented very rapid development of mankind. What is the project “Gilgamesh”? What drives science? What the connection between science and power gave us? Why european world more progressive than Asian and how did this happen? Why have family ties and communities have weakened in the modern world? And also author fears that in the future, in an effort to gain complete control over the Earth, humanity will completely destroy the planet, but he does not believe in the complete destruction of nature, he also predicts the complete destruction of us as a species of \"Homo Sapiens\", since today's science is moving forward with miles of strides, which as a result the future could turn people into cyborgs. </p>\n<p>    In general, the author tries to constantly touch on the topic of people's happiness in the book and tries to build an interdependence between history and people's happiness. We see that after reading this book, you will get a knowledge about how the past culture was built, and how it affects our common culture today. If to be honest, the book expands on these topics more widely and offers very interesting examples to support their theories. In my opinion, every person who wants to somehow get to know this world should read this book at least once, even if he or she does not agree with the opinion of the author. I hope I somehow helped you in making decisions to read this book or not.</p>\n","title":"Sapiens: A brief history of humankind.","date":"2021-01-09"}},"__N_SSG":true}