{"pageProps":{"othersData":{"id":"why-we-need-to-stop-waiting-smth","contentHtml":"<p>    It is a well-known fact that most of humanity has a problem with\nself-organization. Everyone plans their tomorrow-day assuming that they will perform schedule in a strictly, absolute right way without any underwater rocks, but each person who already has experience, will also understand, it won’t make a disciplined person hence all hopes of yours will break right into the wall.  </p>\n<p>    The main problem here we think that just a organizing your future is enough, spending your time in a pointless entertainment every evening of weekday, where you after work coming into house, imagining how you having an enjoy watching TV or some youtube channel(where is no difference actually), swiping instagram, watching TikTok videos, liking, disliking, reading all of those politic news and then reading comments which is filled with angry, disrespect, watching how they hate each other and so on. The problem is, it will never finish, it will happen endlessly until you stop it. They will come and go without your opinion about some incident on another side of the world, or some event which does not affect your life. Of course I know, we’re all small in the big scheme of things and we can lose some part of ourselves, but it is happening just because you want to boil in a flow of events. We will start wasting our own mission which we hold in our hearts time by time and when it will finish just then you will understand “this is the endpoint”, and there is no other way.</p>\n<p>    So why we should not look forward to something in our relatively short life? All of those problems will be gone, when you will start restoring your normal life. Remember when you were a child?! we’re all grown without mobile phones and social networks. My social network was filled up with guys from my yard. My friends-life balance was always equal. I could sleep very well knowing that they cannot text me, there weren't any notifications from different stores, social media and so on. And this is normal life. So, get rid of your mobile phone. Brush your teeth, iron your clothes and sleep just as a normal guy. It all makes sense if you keep a balance.</p>\n<p>    Summarizing all above, don't wait for catastrophe, act today and you will not regret tomorrow about your yesterday decision. We all have a weakness, but we must cope with our vices. I think it is the only right way for our elaboration as a personality.</p>\n","title":"Why we need to stop waiting for something","date":"2020-12-17"}},"__N_SSG":true}